ZeroDayTea/ESP32SmartCamera/src/main.cpp
// #include <stdarg.h>
// #include <stdio.h>
#include <WiFi.h>
#include <ESP32_FTPClient.h>
#include <esp_camera.h>
#include "config.h"
#include "secrets.h"
#include <esp_sntp.h>
#include <esp_log.h>
#include <esp32-hal-log.h>
#include <HardwareSerial.h>
#include <StreamDebugger.h>
#include <TinyGsmClient.h>
#include <ArduinoHttpClient.h>
#include <SPI.h>
#include <SD.h>
#include <FS.h>
#include <Preferences.h>
#include <Update.h>

// globals
#ifdef DUMP_AT_COMMANDS
  StreamDebugger debugger(SerialAT, Serial);
#endif
#ifdef DUMP_AT_COMMANDS
  TinyGsm modem(debugger);
#else
  TinyGsm modem(SerialAT);
#endif

TinyGsmClient client(modem);
HttpClient http(client, OTA_UPDATE_URL, OTA_UPDATE_PORT);
File log_file;

String IMEI = "";
String GPSPosition = "";
String LogContent = "";
String newFirmwareVersion = "";
Preferences preferences;

// function prototypes
String getCurrentDateTime();
String getFormattedDateTime();
String getFormattedImageName();
String getFormattedReportName();
String getSDCardInfo();
void takePhoto();
void sendLogFile();
void initializeConnectionWifi();
void initializeCamera();
String convertToDMS(String coord, String direction);
void getGPSPosition();
void getIMEI();
int syncTime();
void initializeModem();
void initializeSDCard();
int sdCardLogOutput(const char *format, va_list args);
void clearEFS();
void stopFtp(void);
boolean initFtp(void);
int sendFileToFtp(String imageFileName);
boolean sendFileToEFS(String imageFileName, camera_fb_t * fb);
boolean sendPhoto(camera_fb_t * fb);

// datetime as string of numbers
String getCurrentDateTime() {
  String time;
  modem.sendAT("+CCLK?");
  if (modem.waitResponse(10000, time) != 1) {
    ESP_LOGI(TAG, "Failed to get time");
    return "";
  }
  time = time.substring(time.indexOf('"') + 1, time.lastIndexOf('"'));
  int year = time.substring(0, 2).toInt();
  int month = time.substring(3, 5).toInt();
  int day = time.substring(6, 8).toInt();
  int hour = time.substring(9, 11).toInt();
  int minute = time.substring(12, 14).toInt();
  int second = time.substring(15, 17).toInt();

  char result[20];
  snprintf(result, sizeof(result), "%02d%02d20%02d%02d%02d%02d", day, month, year, hour, minute, second);
  return String(result);
}

// datetime as human readable string
String getFormattedDateTime() {
  String time;
  modem.sendAT("+CCLK?");
  if (modem.waitResponse(10000, time) != 1) {
    ESP_LOGI(TAG, "Failed to get time");
    return "";
  }
  time = time.substring(time.indexOf("\"") + 1, time.indexOf("\""));
  int year = time.substring(0, 2).toInt();
  int month = time.substring(3, 5).toInt();
  int day = time.substring(6, 8).toInt();
  int hour = time.substring(9, 11).toInt();
  int minute = time.substring(12, 14).toInt();
  int second = time.substring(15, 17).toInt();

  char result[20];
  snprintf(result, sizeof(result), "%02d/%02d/20%02d %02d:%02d:%02d", day, month, year, hour, minute, second);
  return String(result);
}

// formatted filename for image upload
String getFormattedImageName() {
  return String(DEVICENAME) + "-" + getCurrentDateTime() + ".jpg";
}

// formatted filename for daily report upload
String getFormattedReportName() {
  String dateTime = getCurrentDateTime();
  return dateTime + "-" + String(DEVICENAME) + "-DailyReport.txt";
}

// return the SD card information for logging
String getSDCardInfo() {
  uint64_t cardSize = SD.cardSize() / (1024 * 1024);
  uint64_t usedSpace = cardSize - (SD.totalBytes() / (1024 * 1024));
  String sdInfo = "SD:" + String(usedSpace) + "/" + String(cardSize) + "M";
  return sdInfo;
}

String sendATCommand(String command, String desiredResponse, unsigned long timeout) {
  modem.sendAT(command);
  String result;
  unsigned long startTime = millis();
  boolean ok = false;
  while (!ok && millis() - startTime < timeout) {
    String s = modem.stream.readStringUntil('\n');
    ok = s.indexOf(desiredResponse) >= 0;
    result += s;
  }
  return result;
}

// delete all files in sim7600 EFS to prevent clutter of images
void clearEFS() {
  ESP_LOGI(TAG, "Clearing EFS...");

  // directory for storing all images
  modem.sendAT("+FSCD=E:");
  if (modem.waitResponse(10000) != 1) {
      ESP_LOGI(TAG, "Failed to change directory to E:");
      return;
  }

  modem.sendAT("+FSLS");
  if (modem.waitResponse(5000) != 1) {
    ESP_LOGI(TAG, "Failed to check EFS file listing");
  }

  modem.sendAT("+FSDEL=*.*");
  if (modem.waitResponse(10000) != 1) {
    ESP_LOGI(TAG, "Failed to delete image files");
  } else {
    ESP_LOGI(TAG, "Successfully cleared EFS");
  }
}


// start FTP service on modem and login
boolean initFtp(void) {
  String response = sendATCommand("+CFTPSSTART", "+CFTPSSTART:", 10000);
  if (response.indexOf("ERROR") > 0) {
    ESP_LOGI(TAG, "Failed to start FTP service on modem");
    stopFtp();
    sendATCommand("+CFTPSSTART", "OK", 5000);
  } else {
    ESP_LOGI(TAG, "Started FTP service on modem");
  }

  String loginCommand = String("+CFTPSLOGIN=\"") + FTP_SERVER + "\"," + String(FTP_PORT) + ",\"" + FTP_USER + "\",\"" + FTP_PASS + "\",0";
  response = sendATCommand(loginCommand, "+CFTPSLOGIN:", 20000);
  if (response.indexOf("CFTPSLOGIN: 0") > 0) {
    ESP_LOGI(TAG, "Logged in FTP");
  } else {
    ESP_LOGI(TAG, "Failed to login FTP");
    return false;
  }

  // modem.sendAT("+CFTPTYPE=I");
  // // modem.waitResponse(2000, result);
  // if (modem.waitResponse(5000) != 1) {
  //   ESP_LOGI(TAG, "Failed to set FTP type");
  // }

  // modem.sendAT("+CFTPSCWD=\"/\"");
  // // modem.waitResponse(2000, result);
  // if (modem.waitResponse(5000) != 1) {
  //   ESP_LOGI(TAG, "Failed to set FTP folder");
  // }

  return true;
}

// logout and stop FTP service on modem
void stopFtp(void) {
  String response = sendATCommand("+CFTPSLOGOUT", "+CTFPSLOGOUT:", 2000);
  if (response.indexOf("+CFTPSLOGOUT: 0") >= 0) {
    ESP_LOGI(TAG, "Logged out FTP");
  } else {
    ESP_LOGI(TAG, "Failed to log out FTP");
  }

  response = sendATCommand("+CFTPSSTOP", "+CFTPSSTOP:", 2000);
  if (response.indexOf("+CFTPSSTOP: 0") >= 0) {
    ESP_LOGI(TAG, "Stopped FTP service on modem");
  } else {
    ESP_LOGI(TAG, "Failed to stop FTP service on modem");
  }
}

// send file to FTP server (must be logged in first)
int sendFileToFtp(String fileName) {
  String putCommand = String("+CFTPSPUTFILE=") + "\"/" + fileName + "\"," + "3";
  String response = sendATCommand(putCommand, "+CFTPSPUTFILE:", 100000);
  if (response.indexOf("+CFTPSPUTFILE: 0") >= 0) {
    ESP_LOGI(TAG, "Successfully ran FTP putfile");
    return 0;
  } else {
    ESP_LOGI(TAG, "Failed to run putfile and upload file to ftp");
    return -1;
  }
}

