ZeroDayTea/ESP32SmartCamera/src/main.cpp
// copy camera data to modem EFS sd card
boolean sendFileToEFS(String imageFileName, camera_fb_t * fb) {
  uint8_t *fbBuf = fb->buf;
  size_t len = fb->len;

  modem.sendAT("+FSCD=E:");
  if (modem.waitResponse(20000) != 1) {
    ESP_LOGI(TAG, "Failed to switch EFS directory");
  }

  ESP_LOGI(TAG, "File length: %d", len);
  String uploadCommand = "+CFTRANRX=";
  uploadCommand = uploadCommand + "\"e:/" + imageFileName + "\"," + len;
  ESP_LOGI(TAG, "upload command: %s", uploadCommand.c_str());
  modem.sendAT(uploadCommand);
  if (modem.waitResponse(2000) != 0) { // TODO: fix waiting for the '>' start
    ESP_LOGI(TAG, "Failed to start file upload to EFS");
  }

  modem.stream.write(fbBuf, len);
  modem.stream.flush();
  // wait for the OK response
  unsigned long startTime = millis();
  while (millis() - startTime < 25000) { // timeout for file transfer to EFS
    if (modem.stream.available()) {
      String response = modem.stream.readStringUntil('\n');
      // ESP_LOGI(TAG, "Response: %s", response.c_str());
      if (response.indexOf("OK") != -1) {
        ESP_LOGI(TAG, "File successfully written to EFS");

        // manual check that file was written
        // modem.sendAT("+FSLS");
        // if (modem.waitResponse(20000) != 1) {
        //   ESP_LOGI(TAG, "Failed to check EFS directory");
        // }

        return true;
      }
    }
  }

  ESP_LOGI(TAG, "Failed to write file to EFS");
  return false;
}

boolean sendLogToEFS(String logFileName, String logFileContents) {
  size_t len = logFileContents.length();

  modem.sendAT("+FSCD=E:");
  if (modem.waitResponse(20000) != 1) {
    ESP_LOGI(TAG, "Failed to switch EFS directory");
  }

  ESP_LOGI(TAG, "File length: %d", len);
  String uploadCommand = "+CFTRANRX=";
  uploadCommand = uploadCommand + "\"e:/" + logFileName + "\"," + len;
  ESP_LOGI(TAG, "upload command: %s", uploadCommand.c_str());
  modem.sendAT(uploadCommand);
  if (modem.waitResponse(2000) != 0) { // TODO: fix waiting for the '>' start
    ESP_LOGI(TAG, "Failed to start file upload to EFS");
  }

  modem.stream.write(logFileContents.c_str(), len);
  modem.stream.flush();
  // wait for the OK response
  unsigned long startTime = millis();
  while (millis() - startTime < 25000) { // timeout for file transfer to EFS
    if (modem.stream.available()) {
      String response = modem.stream.readStringUntil('\n');
      // ESP_LOGI(TAG, "Response: %s", response.c_str());
      if (response.indexOf("OK") != -1) {
        ESP_LOGI(TAG, "File successfully written to EFS");

        // manual check that file was written
        // modem.sendAT("+FSLS");
        // if (modem.waitResponse(20000) != 1) {
        //   ESP_LOGI(TAG, "Failed to check EFS directory");
        // }

        return true;
      }
    }
  }

  ESP_LOGI(TAG, "Failed to write file to EFS");
  return false;
}

// copy file to modem and send it to FTP server
boolean sendPhoto(camera_fb_t * fb) {
  String imageFileName = getFormattedImageName();
  if (!sendFileToEFS(imageFileName, fb)){
    ESP_LOGI(TAG, "Error while sending file to EFS. Is SD card ok ?");
    return false;
  };
  if (!initFtp()) {
    ESP_LOGI(TAG, "Error while conecting to FTP");
    return false;
  };
  int ftpResult = -1;
  int retries = 3;
  while (ftpResult != 0 && retries >= 0) {
    ftpResult = sendFileToFtp(imageFileName);
    retries--;
    if(ftpResult != 0){
      ESP_LOGI(TAG, "Error sending file to FTP, retrying, number of retires left : %d", retries);
    }
  }
  stopFtp();
  if (ftpResult == 0){
    return true;
  } else {
    ESP_LOGI(TAG, "Cannot send file to FTP");
    return false;
  }
}

boolean sendLogFile(String logFileContents) {
  String logFileName = getFormattedImageName();
  if (!sendLogToEFS(logFileName, logFileContents)){
    ESP_LOGI(TAG, "Error while sending file to EFS. Is SD card ok ?");
    return false;
  };
  if (!initFtp()) {
    ESP_LOGI(TAG, "Error while conecting to FTP");
    return false;
  };
  int ftpResult = -1;
  int retries = 3;
  while (ftpResult != 0 && retries >= 0) {
    ftpResult = sendFileToFtp(logFileName);
    retries--;
    if(ftpResult != 0){
      ESP_LOGI(TAG, "Error sending file to FTP, retrying, number of retires left : %d", retries);
    }
  }
  stopFtp();
  if (ftpResult == 0){
    return true;
  } else {
    ESP_LOGI(TAG, "Cannot send file to FTP");
    return false;
  }
}

// take photo, process it, and send to server if needed
void takePhoto() {
  camera_fb_t *fb = esp_camera_fb_get();
  if (!fb) {
    ESP_LOGI(TAG, "Camera capture failed");
    return;
  }
  //   unsigned int totalPictures = preferences.getUInt("totalPictures", 0);
  //   totalPictures++;
  //   preferences.putUInt("totalPictures", totalPictures);

  //   ESP_LOGI(TAG, "Total Pictures: %d", totalPictures);

  // send image over WIFI
  // ftp.OpenConnection();
  // ftp.InitFile("Type I");
  // ftp.ChangeWorkDir("/");
  // String filename = getFormattedImageName();
  // ftp.NewFile(filename.c_str());
  // ftp.WriteData(fb->buf, fb->len);
  // ftp.CloseFile();
  // ftp.CloseConnection();

  // send image over 4G if interesting
  int chance = random(200);
  // ESP_LOGI(TAG, "random number generated: %d", chance);
  if(chance == 1) {
    boolean sendPhotoOk = false;
    for (int i=0; i<3; i++) {
      sendPhotoOk = sendPhoto(fb);
      if (sendPhotoOk) {
        break;
      }
    }

    if (!sendPhotoOk) {
      esp_camera_fb_return(fb);
      ESP_LOGI(TAG, "Time: %s", String(esp_timer_get_time()));
      ESP_LOGI(TAG, "Failed to upload photo successfully");
      return;
    } else {
      // return the frame buffer back to the driver for reuse
      esp_camera_fb_return(fb);

      ESP_LOGI(TAG, "Time: %s", String(esp_timer_get_time()));
      ESP_LOGI(TAG, "Photo taken and uploaded successfully");

      unsigned int sendTimes = preferences.getUInt("sendTimes", 0);
      sendTimes++;
      preferences.putUInt("sendTimes", sendTimes);

      ESP_LOGI(TAG, "Send Times: %d", sendTimes);
    }
  }
  esp_camera_fb_return(fb);
}

// send formatted logfile with sensor information
void sendLogFile() {
  String formattedDateTime = getFormattedDateTime();
  getGPSPosition(); // update GPS position data

