ZeroDayTea/ESP32SmartCamera/src/main.cpp
  unsigned int sendTimes = preferences.getUInt("sendTimes", 0);
  // unsigned int totalPictures = preferences.getUInt("totalPictures", 0);

  LogContent = "IMEI:" + IMEI + "\n";
  LogContent += "CSQ:12\n";
  LogContent += "CamID:" + String(DEVICENAME) + "\n";
  LogContent += "Temp:9C\n";
  LogContent += "Date:" + formattedDateTime + "\n";
  LogContent += "Bat:100%\n";
  LogContent += getSDCardInfo() + "\n";
  LogContent += "Total:" + String("0") + "\n";
  LogContent += "Send:" + String(sendTimes) + "\n";
  LogContent += "GPS:" + GPSPosition + "\n";

  ESP_LOGI(TAG, "Log Content:\n%s", LogContent.c_str());

  // send logfile over WiFI
  // ftp.OpenConnection();
  // ftp.InitFile("Type I");
  // ftp.ChangeWorkDir("/");
  // String fileName = getFormattedReportName();
  // ftp.NewFile(fileName.c_str());
  // unsigned char *data = (unsigned char *)LogContent.c_str();
  // ftp.WriteData(data, LogContent.length());
  // ftp.CloseFile();
  // ftp.CloseConnection();

  // send logfile over 4G


  ESP_LOGI(TAG, "Time: %s", String(esp_timer_get_time()).c_str());
  ESP_LOGI(TAG, "Daily report generated and uploaded successfully");
}

// connect to WiFi
// void initializeConnectionWifi() {
//   ESP_LOGI(TAG, "Connecting to WiFi...");
//   WiFi.begin(WIFI_SSID, WIFI_PASSWORD);
//   while (WiFi.status() != WL_CONNECTED) {
//     delay(1000);
//     ESP_LOGI(TAG, "Connecting to WiFi...");
//   }
//   ESP_LOGI(TAG, "Connected to WiFi");
// }

// initialize the camera
void initializeCamera() {
  ESP_LOGI(TAG, "Initializing camera...");

  // camera settings
  camera_config_t config;
  config.ledc_channel = LEDC_CHANNEL_0;
  config.ledc_timer = LEDC_TIMER_0;
  config.pin_d0 = CAM_Y2_PIN;
  config.pin_d1 = CAM_Y3_PIN;
  config.pin_d2 = CAM_Y4_PIN;
  config.pin_d3 = CAM_Y5_PIN;
  config.pin_d4 = CAM_Y6_PIN;
  config.pin_d5 = CAM_Y7_PIN;
  config.pin_d6 = CAM_Y8_PIN;
  config.pin_d7 = CAM_Y9_PIN;
  config.pin_xclk = CAM_XCLK_PIN;
  config.pin_pclk = CAM_PCLK_PIN;
  config.pin_vsync = CAM_VSYNC_PIN;
  config.pin_href = CAM_HREF_PIN;
  config.pin_sccb_sda = CAM_SIOD_PIN;
  config.pin_sccb_scl = CAM_SIOC_PIN;
  config.pin_pwdn = CAM_PWDN_PIN;
  config.pin_reset = CAM_RESET_PIN;
  config.xclk_freq_hz = 20000000; // EXPERIMENTAL: Set to 16MHz on ESP32-S2 or ESP32-S3 to enable EDMA mode
  config.pixel_format = PIXFORMAT_JPEG; // YUV422,GRAYSCALE,RGB565,JPEG

  if (psramFound()) {
    ESP_LOGI(TAG, "Using Framesize UXGA");
    config.frame_size = FRAMESIZE_UXGA; // change for better resolution. do not go above QVGA size when not jpeg
    config.jpeg_quality = 10; // 0-63 with lower number is better quality
    config.fb_count = 2;
  } else {
    ESP_LOGI(TAG, "Using Framesize SVGA");
    config.frame_size = FRAMESIZE_SVGA;
    config.jpeg_quality = 12;
    config.fb_count = 1;
    config.fb_location = CAMERA_FB_IN_DRAM;
  }

#if defined(CAMERA_MODEL_ESP_EYE)
    pinMode(13, INPUT_PULLUP);
    pinMode(14, INPUT_PULLUP);
#endif

  // camera init
  esp_err_t err = esp_camera_init(&config);
  if (err != ESP_OK) {
    ESP_LOGI(TAG, "Camera init failed with error 0x%x", err);
    return;
  }

  sensor_t *s = esp_camera_sensor_get();
  // daytime settings
  s->set_vflip(s, 1);

  // nighttime settings
  // s->set_vflip(s, 1);

  // TODO: on during the day, off during the night
  ESP_LOGI(TAG, "IR Filter On");
  pinMode(CAM_IR_PIN, OUTPUT);
  digitalWrite(CAM_IR_PIN, HIGH);

  ESP_LOGI(TAG, "Camera initialized");
}

// convert ddmm.mmmmmm GPS position to DMS
String convertToDMS(String coord, String direction) {
  // latitude is in ddmm.mmmmmm format while longitude is in dddmm.mmmmmm format while
  int degLength = (coord.length() > 11) ? 3 : 2;
  int degrees = coord.substring(0, degLength).toInt();
  float minutes = coord.substring(degLength).toFloat();

  int wholeMinutes = int(minutes);
  float fractionalMinutes = minutes - wholeMinutes;
  float seconds = fractionalMinutes * 60;

  return direction + String(degrees) + "*" + String(wholeMinutes) + "'" + String(seconds, 2) + "\"";
}

// enables GNSS and gathers position data
void getGPSPosition() {
    ESP_LOGI(TAG, "Enabling GPS/GNSS/GLONASS and gathering position data");

    modem.sendAT("+CGPS=1"); // enable GPS
    if (modem.waitResponse(10000) != 1) {
        ESP_LOGI(TAG, "Failed to enable GPS");
        return;
    }

    String gps_latitude = "";
    String gps_longitude = "";
    while (true) {
        ESP_LOGI(TAG, "Requesting GPS info");

        modem.sendAT("+CGNSSINFO");
        String response = modem.stream.readStringUntil('\n');
        ESP_LOGI(TAG, "%s", response.c_str());

        if (response.indexOf(",N,") != -1 || response.indexOf(",S,") != -1) {
            int latStart = response.indexOf(",", 22) + 1;
            int latEnd = response.indexOf(",", latStart);
            gps_latitude = response.substring(latStart, latEnd);

            int latDirEnd = response.indexOf(",", latEnd + 1);
            String latDir = response.substring(latEnd + 1, latDirEnd);

            int lonStart = response.indexOf(",", latDirEnd) + 1;
            int lonEnd = response.indexOf(",", lonStart);
            gps_longitude = response.substring(lonStart, lonEnd);

            int lonDirEnd = response.indexOf(",", lonEnd + 1);
            String lonDir = response.substring(lonEnd + 1, lonDirEnd);

            String latitudeDMS = convertToDMS(gps_latitude, latDir);
            String longitudeDMS = convertToDMS(gps_longitude, lonDir);

            GPSPosition = latitudeDMS + " " + longitudeDMS;
            ESP_LOGI(TAG, "GPS Position: %s", GPSPosition.c_str());
            break;
        } else {
            ESP_LOGI(TAG, "Couldn't get GPS info, retrying in 10s.");
            delay(15000);
        }
    }
}

// get IMEI number from GSM module
void getIMEI() {
  ESP_LOGI(TAG, "Updating IMEI");
  modem.sendAT("+CGSN");
  String IMEI_buf = "";
  if (modem.waitResponse(10000, IMEI_buf) != 1) {
    ESP_LOGI(TAG, "Failed to get IMEI");
    return;
  }
  IMEI = IMEI_buf.substring(2, 17); // parse AT command response
  ESP_LOGI(TAG, "IMEI: %s", IMEI.c_str());
}

// ensure time is set
int syncTime() {
  ESP_LOGI(TAG, "Syncing Time...");

  modem.sendAT("+CTZU=1");
  if (modem.waitResponse(10000) != 1) {
    ESP_LOGI(TAG, "Failed to enable automatic time update");
  }

  modem.sendAT("+CNTP=\"pool.ntp.org\",8");
  if (modem.waitResponse(10000) != 1) {
    ESP_LOGI(TAG, "Failed to set NTP server");
    return -1;
  }
  modem.sendAT("+CNTP");
  if (modem.waitResponse(10000) != 1) {
    ESP_LOGI(TAG, "Failed to sync time");
    return -1;
  }

  // timezone
  setenv("TZ", "UTC-2", 1);
  tzset();

  String response = "";
  modem.sendAT("+CCLK?");
  if (modem.waitResponse(10000, response) != 1) {
    ESP_LOGI(TAG, "Failed to get time");
  }

