ZeroDayTea/ESP32SmartCamera/src/main.cpp
  String time = response.substring(response.indexOf('"') + 1, response.lastIndexOf('"'));
  int year = time.substring(0,2).toInt();
  ESP_LOGI(TAG, "Time synced. Current datetime in yy/MM/dd,hh:mm:ss+zz is %s", time.c_str());
  return year;
}

// initiale the T-PCIE modem
void initializeModem() {
  ESP_LOGI(TAG, "Initializing modem...");
  pinMode(PCIE_PWR_PIN, OUTPUT);
  digitalWrite(PCIE_PWR_PIN, HIGH);
  delay(300);
  digitalWrite(PCIE_PWR_PIN, LOW);
  delay(3000);
  SerialAT.begin(115200, SERIAL_8N1, PCIE_RX_PIN, PCIE_TX_PIN);
  while(!modem.init()) {
    ESP_LOGI(TAG, "Failed to restart modem, delaying 3s and retrying");
    delay(3000);
  }
  ESP_LOGI(TAG, "Initialized modem");

  // register network
  String result;
  while(true) {
    Serial.println("Waiting for network...");
    modem.sendAT("+CREG?");
    if (modem.waitResponse(5000, result) == 1) {
      if (result.indexOf("+CREG: 0,1") > 0 || result.indexOf("+CREG: 0,5") > 0) {
        break;
      }
    }
    delay(2000);
  }

  // set to GSM mode
  modem.sendAT("+CNMP=38");
  if (modem.waitResponse(10000) != 1) {
    ESP_LOGI(TAG, "setNetworkMode to GSM failed");
    return;
  }
}

// log messages to SD card
int sdCardLogOutput(const char *format, va_list args) {
	char buf[128];
	int ret = vsnprintf(buf, sizeof(buf), format, args);
  if (log_file) {
    Serial.println(buf);
    log_file.print(buf);
    log_file.flush();
  }
	return ret;
}

// initialize the SD card
void initializeSDCard() {
  SPI.begin(SD_SCLK_PIN, SD_MISO_PIN, SD_MOSI_PIN, SD_CS_PIN);
  if (!SD.begin(SD_CS_PIN)) {
    ESP_LOGE(TAG, "Card Mount Failed");
    return;
  }
  uint8_t cardType = SD.cardType();
  if (cardType == CARD_NONE) {
    ESP_LOGE(TAG, "No SD card attached");
    return;
  }

  ESP_LOGI(TAG, "Initialized SD Card Type: ");
  if (cardType == CARD_MMC) {
    ESP_LOGI(TAG, "MMC");
  } else if (cardType == CARD_SD) {
    ESP_LOGI(TAG, "SDSC");
  } else if (cardType == CARD_SDHC) {
    ESP_LOGI(TAG, "SDHC");
  } else {
    ESP_LOGI(TAG, "UNKNOWN");
  }

  log_file = SD.open(LOG_FILE_NAME, FILE_APPEND);
  if (!log_file) {
    ESP_LOGE(TAG, "Failed to open log file");
  } else {
    ESP_LOGI(TAG, "Using SD card callback for logging");
    esp_log_set_vprintf(sdCardLogOutput);
  }
}

// check if firmware update is necessary
bool checkForUpdate() {
  modem.sendAT("+HTTPINIT");
  if (modem.waitResponse(10000) != 1) {
    ESP_LOGI(TAG, "Failed to initialize HTTP");
    return false;
  }

  modem.sendAT(String("+HTTPPARA=\"URL\",\"") + OTA_UPDATE_URL + OTA_VERSION_ENDPOINT + "\"");
  if (modem.waitResponse(10000) != 1) {
    ESP_LOGI(TAG, "Failed to set URL");
    return false;
  }

  String response = sendATCommand("+HTTPACTION=0", "+HTTPACTION: 0,200", 20000);

  response = sendATCommand("+HTTPREAD=99", "+HTTPREAD: 0", 20000);
  response = response.substring(22, 28); // splice out the version number

  modem.sendAT("+HTTPTERM");
  if (modem.waitResponse(10000) != 1) {
    ESP_LOGI(TAG, "Failed to disable HTTP service");
  }

  ESP_LOGI(TAG, "Response: %s", response.c_str());

  String currentVersion = preferences.getString("firmwareVersion", "");
  if (response != currentVersion) {
    ESP_LOGI(TAG, "New firmware version available");
    newFirmwareVersion = response;
    return true;
  }

  ESP_LOGI(TAG, "No new firmware version available");
  return false;
}

// download firmware file from remote server to SD card
bool downloadFirmware() {
  const int chunkSize = 1024;

  modem.sendAT("+HTTPINIT");
  if (modem.waitResponse(10000) != 1) {
    ESP_LOGI(TAG, "Failed to initialize HTTP");
    return false;
  }

  modem.sendAT(String("+HTTPPARA=\"URL\",\"") + OTA_UPDATE_URL + OTA_UPDATE_ENDPOINT + "\"");
  if (modem.waitResponse(10000) != 1) {
    ESP_LOGI(TAG, "Failed to set URL");
    return false;
  }

  // GET request
  String response = sendATCommand("+HTTPACTION=0", "+HTTPACTION: 0,200", 20000);

  // int fileLength = response.substring(24, response.length() - 1).toInt(); // parse out the length returned after code 200
  // ESP_LOGI(TAG, "File Length To Download: %d", fileLength);

  File firmware = SD.open(FIRMWARE_FILE_NAME, FILE_WRITE);
  if (!firmware) {
    ESP_LOGI(TAG, "Failed to open file for writing");
    return false;
  }

  // read the firmware file in chunks
  int bytesRead = 0;
  while (true) {
    String readCommand = String("+HTTPREAD=") + bytesRead + "," + chunkSize;
    // String response = sendATCommand(readCommand, "+HTTPREAD: 0", 10000);

    // modified sendATCommand to prevent newline stripping
    modem.sendAT(readCommand);
    String response;
    unsigned long startTime = millis();
    boolean ok = false;
    while (!ok && millis() - startTime < 10000) {
      String s = modem.stream.readStringUntil('\n');
      ok = s.indexOf("+HTTPREAD: 0") >= 0;
      response += s + '\n';
    }
    response.remove(response.length() - 1, 1);

    if (response.indexOf("ERROR") != -1) {
      break;
    }

    if (response.indexOf("+HTTPREAD:") == -1) {
      ESP_LOGI(TAG, "Failed to read HTTP chunk");
      firmware.close();
      return false;
    }

    // extract the data part from the response
    int startIndex = response.indexOf('\r', response.indexOf("+HTTPREAD:")) + 2;
    int endIndex = response.length() - 15; // parse out the +HTTPREAD: 0 at end
    String chunk = response.substring(startIndex, endIndex);
    firmware.print(chunk);
    firmware.flush();
    bytesRead += chunk.length();

    // // if returned data is shorter than chunk size then finished
    // String dataSize = response.substring(response.indexOf("DATA,") + 5);
    // int dataSizeInt = dataSize.substring(0, dataSize.indexOf('\r')).toInt();

    // // Check if we have read all the data
    // if (dataSizeInt < chunkSize) {
    //   break;
    // }
  }

  // Close the file
  firmware.flush();
  firmware.close();

  modem.sendAT("+HTTPTERM");
  if (modem.waitResponse(10000) != 1) {
    ESP_LOGI(TAG, "Failed to disable HTTP service");
  }

  ESP_LOGI(TAG, "Firmware downloaded successfully");
  return true;
}

// flash new firmware from SD card
void applyFirmware() {
  File firmware = SD.open(FIRMWARE_FILE_NAME, FILE_READ);
  if (!firmware) {
    ESP_LOGI(TAG, "Failed to open firmware file");
    return;
  }

