ZeroDayTea/ESP32SmartCamera/src/main.cpp
  size_t firmwareSize = firmware.size();

  if (!Update.begin(firmwareSize)) {
    ESP_LOGI(TAG, "Failed to start update");
    return;
  }

  size_t written = Update.writeStream(firmware);
  if (written == firmwareSize) {
    ESP_LOGI(TAG, "Written : %d successfully", written);
  } else {
    ESP_LOGI(TAG, "Written only : %d/%d", written, firmwareSize);
  }

  if (Update.end()) {
    ESP_LOGI(TAG, "OTA done!");
    if (Update.isFinished()) {
      ESP_LOGI(TAG, "Update successfully completed. Rebooting.");
      preferences.putString("firmwareVersion", newFirmwareVersion);
      ESP.restart();
    } else {
      ESP_LOGI(TAG, "Update not finished? Something went wrong!");
    }
  } else {
    ESP_LOGI(TAG, "Error #: %d", Update.getError());
  }

  firmware.close();
}

void setup() {
  pinMode(PWR_ON_PIN, OUTPUT);
  digitalWrite(PWR_ON_PIN, HIGH);
  delay(100);
  // Serial2.begin(115200, SERIAL_8N1, PCIE_RX_PIN, PCIE_TX_PIN);
  Serial.begin(115200);
  delay(10);
  esp_log_level_set("*", ESP_LOG_VERBOSE);
  esp_log_level_set(TAG, ESP_LOG_VERBOSE);

  initializeSDCard();

  ESP_LOGI(TAG, "Starting camera sensor %s...", DEVICENAME);

  // disable WiFi and bluetooth for power consumption
  WiFi.mode(WIFI_OFF);
  btStop();

  // initialize NVME
  preferences.begin("image-data", false);

  // initializeConnectionWifi();

  initializeModem();

  getIMEI();

  clearEFS();

  // OTA updates
  if (checkForUpdate()) {
    for (int retries = 0; retries < 5; ++retries) {
      if (downloadFirmware()) {
        applyFirmware();
      }
      delay(10000);
    }
  }

  initializeCamera();

  int year = syncTime();
  while (year < 24) {
    year = syncTime();
  }

  // sendLogFile();
  // takePhoto();
}

void loop() {
  // unsigned long lastReportTime = preferences.getULong("lastReportTime", 0);
  // unsigned long currentTime = getCurrentTime();
  static unsigned long lastReportTime = 0;
  static unsigned long lastOTACheckTime = 0;
  unsigned long currentTime = millis();

  takePhoto();

  if (currentTime - lastReportTime >= 86400000) { // 24 hours = 86400 seconds = 86400000 millis
    lastReportTime = currentTime;
    // preferences.putULong("lastReportTime", lastReportTime);
    // sendLogFile();
  }

  if (currentTime - lastOTACheckTime >= 1800000) {
    lastOTACheckTime = currentTime;
    if (checkForUpdate()) {
      for (int retries = 0; retries < 5; ++retries) {
        if (downloadFirmware()) {
          applyFirmware();
        }
        delay(10000);
      }
    }

    clearEFS();
  }

  ESP_LOGI(TAG, "Heap: %d/%d, PSRAM: %d/%d", (ESP.getHeapSize() - ESP.getFreeHeap()), ESP.getHeapSize(), (ESP.getPsramSize() - ESP.getFreePsram()), ESP.getPsramSize());

  // delay(10000);
  esp_sleep_enable_timer_wakeup(10 * uS_TO_S_FACTOR); //light sleep between photos
  delay(100);
  esp_light_sleep_start();
}
